In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [2]:
df = pd.read_csv('homeprices.csv')

In [3]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [6]:
df.bedrooms.fillna(df.bedrooms.median(),inplace=True)

In [7]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [9]:
input_df = df.drop('price',axis='columns')
input_df

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [10]:
df.price

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [11]:
model = linear_model.LinearRegression()
model.fit(input_df,df.price)

LinearRegression()

In [12]:
model.predict([[3000,3,40]])

array([498408.25158031])

In [13]:
model.predict([[3000,3,10]])

array([595359.7888393])

In [14]:
model.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [15]:
model.intercept_

221323.0018654043

In [16]:
model.predict([[2500,4,5]])

array([578876.03748933])

# Practice

In [3]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [17]:
df = pd.read_csv('hiring.csv')

In [18]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [19]:
df.rename(columns={'test_score(out of 10)':'testscore','interview_score(out of 10)':'interview','salary($)':'salary'},inplace=True)

In [20]:
df.testscore.fillna(df.testscore.median(),inplace=True)

In [21]:
df.columns

Index(['experience', 'testscore', 'interview', 'salary'], dtype='object')

In [22]:
df

  experience  testscore  interview  salary
0        NaN        8.0          9   50000
1        NaN        8.0          6   45000
2       five        6.0          7   60000
3        two       10.0         10   65000
4      seven        9.0          6   70000
5      three        7.0         10   62000
6        ten        8.0          7   72000
7     eleven        7.0          8   80000

In [23]:
df.experience.fillna(method='bfill',inplace=True)

In [24]:
df

  experience  testscore  interview  salary
0       five        8.0          9   50000
1       five        8.0          6   45000
2       five        6.0          7   60000
3        two       10.0         10   65000
4      seven        9.0          6   70000
5      three        7.0         10   62000
6        ten        8.0          7   72000
7     eleven        7.0          8   80000

In [26]:
df['experience'][0:3] = 5

<ipython-input-26-39e693d6a9e2>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['experience'][0:3] = 5

In [27]:
df

  experience  testscore  interview  salary
0          5        8.0          9   50000
1          5        8.0          6   45000
2          5        6.0          7   60000
3        two       10.0         10   65000
4      seven        9.0          6   70000
5      three        7.0         10   62000
6        ten        8.0          7   72000
7     eleven        7.0          8   80000

In [28]:
df['experience'][3] = 2

<ipython-input-28-2dd361f8bb07>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['experience'][3] = 2

In [29]:
df['experience'][4] = 7

<ipython-input-29-1861c7f3420d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['experience'][4] = 7

In [30]:
df

  experience  testscore  interview  salary
0          5        8.0          9   50000
1          5        8.0          6   45000
2          5        6.0          7   60000
3          2       10.0         10   65000
4          7        9.0          6   70000
5      three        7.0         10   62000
6        ten        8.0          7   72000
7     eleven        7.0          8   80000

In [31]:
df['experience'][5] = 3

<ipython-input-31-3ebf6d0a1859>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['experience'][5] = 3

In [32]:
df['experience'][6] = 10

<ipython-input-32-0758f98882ed>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['experience'][6] = 10

In [33]:
df['experience'][7] = 11

<ipython-input-33-d29ad5902798>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['experience'][7] = 11

In [34]:
df

  experience  testscore  interview  salary
0          5        8.0          9   50000
1          5        8.0          6   45000
2          5        6.0          7   60000
3          2       10.0         10   65000
4          7        9.0          6   70000
5          3        7.0         10   62000
6         10        8.0          7   72000
7         11        7.0          8   80000

In [37]:
input_df = df.drop('salary',axis='columns')

In [38]:
input_df

  experience  testscore  interview
0          5        8.0          9
1          5        8.0          6
2          5        6.0          7
3          2       10.0         10
4          7        9.0          6
5          3        7.0         10
6         10        8.0          7
7         11        7.0          8

In [39]:
model = linear_model.LinearRegression()

In [40]:
model.fit(input_df,df.salary)

LinearRegression()

In [41]:
model.predict([[2,9,6]])

array([45979.08171436])

In [42]:
model.predict([[12,10,10]])

array([92515.82422727])